## Plan Result (sbox_landing)




<pre><code>Plan: 213 to add, 3 to change, 0 to destroy.</code></pre>

* Create
  * azurerm_container_group.runner[&#34;00dlrm-ingestionengine&#34;]
  * module.data_landing_zone[&#34;01&#34;].azurerm_data_factory_integration_runtime_self_hosted.this
  * module.data_landing_zone[&#34;01&#34;].azurerm_eventhub_namespace.this
  * module.data_landing_zone[&#34;01&#34;].azurerm_key_vault_secret.log_analytics_workspace_id
  * module.data_landing_zone[&#34;01&#34;].azurerm_key_vault_secret.log_analytics_workspace_secret
  * module.data_landing_zone[&#34;01&#34;].azurerm_key_vault_secret.mssql_password
  * module.data_landing_zone[&#34;01&#34;].azurerm_key_vault_secret.mssql_username
  * module.data_landing_zone[&#34;01&#34;].azurerm_key_vault_secret.mysql_connection_string
  * module.data_landing_zone[&#34;01&#34;].azurerm_key_vault_secret.mysql_password
  * module.data_landing_zone[&#34;01&#34;].azurerm_key_vault_secret.mysql_username
  * module.data_landing_zone[&#34;01&#34;].azurerm_key_vault_secret.synapse_sql_password
  * module.data_landing_zone[&#34;01&#34;].azurerm_key_vault_secret.synapse_sql_username
  * module.data_landing_zone[&#34;01&#34;].azurerm_log_analytics_workspace.this
  * module.data_landing_zone[&#34;01&#34;].azurerm_private_dns_zone_virtual_network_link.data_landing_link[&#34;privatelink.adf.azure.com&#34;]
  * module.data_landing_zone[&#34;01&#34;].azurerm_private_dns_zone_virtual_network_link.data_landing_link[&#34;privatelink.blob.core.windows.net&#34;]
  * module.data_landing_zone[&#34;01&#34;].azurerm_private_dns_zone_virtual_network_link.data_landing_link[&#34;privatelink.datafactory.azure.net&#34;]
  * module.data_landing_zone[&#34;01&#34;].azurerm_private_dns_zone_virtual_network_link.data_landing_link[&#34;privatelink.dev.azuresynapse.net&#34;]
  * module.data_landing_zone[&#34;01&#34;].azurerm_private_dns_zone_virtual_network_link.data_landing_link[&#34;privatelink.dfs.core.windows.net&#34;]
  * module.data_landing_zone[&#34;01&#34;].azurerm_private_dns_zone_virtual_network_link.data_landing_link[&#34;privatelink.mysql.database.azure.com&#34;]
  * module.data_landing_zone[&#34;01&#34;].azurerm_private_dns_zone_virtual_network_link.data_landing_link[&#34;privatelink.servicebus.windows.net&#34;]
  * module.data_landing_zone[&#34;01&#34;].azurerm_private_dns_zone_virtual_network_link.data_landing_link[&#34;privatelink.sql.azuresynapse.net&#34;]
  * module.data_landing_zone[&#34;01&#34;].azurerm_private_dns_zone_virtual_network_link.data_landing_link[&#34;privatelink.vaultcore.azure.net&#34;]
  * module.data_landing_zone[&#34;01&#34;].azurerm_resource_group.this[&#34;di001&#34;]
  * module.data_landing_zone[&#34;01&#34;].azurerm_resource_group.this[&#34;di002&#34;]
  * module.data_landing_zone[&#34;01&#34;].azurerm_resource_group.this[&#34;dp001&#34;]
  * module.data_landing_zone[&#34;01&#34;].azurerm_resource_group.this[&#34;dp002&#34;]
  * module.data_landing_zone[&#34;01&#34;].azurerm_resource_group.this[&#34;external-storage&#34;]
  * module.data_landing_zone[&#34;01&#34;].azurerm_resource_group.this[&#34;logging&#34;]
  * module.data_landing_zone[&#34;01&#34;].azurerm_resource_group.this[&#34;management&#34;]
  * module.data_landing_zone[&#34;01&#34;].azurerm_resource_group.this[&#34;metadata&#34;]
  * module.data_landing_zone[&#34;01&#34;].azurerm_resource_group.this[&#34;network&#34;]
  * module.data_landing_zone[&#34;01&#34;].azurerm_resource_group.this[&#34;runtimes&#34;]
  * module.data_landing_zone[&#34;01&#34;].azurerm_resource_group.this[&#34;shared-integration&#34;]
  * module.data_landing_zone[&#34;01&#34;].azurerm_resource_group.this[&#34;shared-product&#34;]
  * module.data_landing_zone[&#34;01&#34;].azurerm_resource_group.this[&#34;storage&#34;]
  * module.data_landing_zone[&#34;01&#34;].azurerm_role_assignment.datafactory_databricks
  * module.data_landing_zone[&#34;01&#34;].azurerm_role_assignment.datafactory_storage[&#34;curated&#34;]
  * module.data_landing_zone[&#34;01&#34;].azurerm_role_assignment.datafactory_storage[&#34;raw&#34;]
  * module.data_landing_zone[&#34;01&#34;].azurerm_storage_data_lake_gen2_filesystem.this[&#34;curated&#34;]
  * module.data_landing_zone[&#34;01&#34;].azurerm_storage_data_lake_gen2_filesystem.this[&#34;external&#34;]
  * module.data_landing_zone[&#34;01&#34;].azurerm_storage_data_lake_gen2_filesystem.this[&#34;raw&#34;]
  * module.data_landing_zone[&#34;01&#34;].azurerm_storage_data_lake_gen2_filesystem.this[&#34;workspace&#34;]
  * module.data_landing_zone[&#34;01&#34;].azurerm_storage_management_policy.this[&#34;curated&#34;]
  * module.data_landing_zone[&#34;01&#34;].azurerm_storage_management_policy.this[&#34;external&#34;]
  * module.data_landing_zone[&#34;01&#34;].azurerm_storage_management_policy.this[&#34;raw&#34;]
  * module.data_landing_zone[&#34;01&#34;].azurerm_storage_management_policy.this[&#34;workspace&#34;]
  * module.data_landing_zone[&#34;01&#34;].azurerm_synapse_workspace.this
  * module.data_landing_zone[&#34;01&#34;].random_password.synapse_sql_password
  * module.data_landing_zone[&#34;01&#34;].module.logging_vault.azurerm_key_vault.kv
  * module.data_landing_zone[&#34;01&#34;].module.logging_vault.azurerm_key_vault_access_policy.creator_access_policy
  * module.data_landing_zone[&#34;01&#34;].module.logging_vault.azurerm_key_vault_access_policy.developer[0]
  * module.data_landing_zone[&#34;01&#34;].module.logging_vault.azurerm_key_vault_access_policy.product_team_access_policy
  * module.data_landing_zone[&#34;01&#34;].module.logging_vault.azurerm_monitor_diagnostic_setting.kv-ds
  * module.data_landing_zone[&#34;01&#34;].module.logging_vault_pe.azurerm_private_endpoint.this
  * module.data_landing_zone[&#34;01&#34;].module.metadata_mssql.azurerm_mssql_database.this[&#34;ingest01-metadata-db-sbox&#34;]
  * module.data_landing_zone[&#34;01&#34;].module.metadata_mssql.azurerm_mssql_server.this
  * module.data_landing_zone[&#34;01&#34;].module.metadata_mssql.azurerm_private_endpoint.metadata_mssql_pe[0]
  * module.data_landing_zone[&#34;01&#34;].module.metadata_mssql.random_password.mssql_password[0]
  * module.data_landing_zone[&#34;01&#34;].module.metadata_mysql.azurerm_mysql_flexible_database.this[&#34;ingest01-HiveMetastoreDb-sbox&#34;]
  * module.data_landing_zone[&#34;01&#34;].module.metadata_mysql.azurerm_mysql_flexible_server.this
  * module.data_landing_zone[&#34;01&#34;].module.metadata_mysql.random_password.mysql_password[0]
  * module.data_landing_zone[&#34;01&#34;].module.metadata_vault[&#34;meta001&#34;].azurerm_key_vault.kv
  * module.data_landing_zone[&#34;01&#34;].module.metadata_vault[&#34;meta001&#34;].azurerm_key_vault_access_policy.creator_access_policy
  * module.data_landing_zone[&#34;01&#34;].module.metadata_vault[&#34;meta001&#34;].azurerm_key_vault_access_policy.developer[0]
  * module.data_landing_zone[&#34;01&#34;].module.metadata_vault[&#34;meta001&#34;].azurerm_key_vault_access_policy.product_team_access_policy
  * module.data_landing_zone[&#34;01&#34;].module.metadata_vault[&#34;meta001&#34;].azurerm_monitor_diagnostic_setting.kv-ds
  * module.data_landing_zone[&#34;01&#34;].module.metadata_vault[&#34;meta002&#34;].azurerm_key_vault.kv
  * module.data_landing_zone[&#34;01&#34;].module.metadata_vault[&#34;meta002&#34;].azurerm_key_vault_access_policy.creator_access_policy
  * module.data_landing_zone[&#34;01&#34;].module.metadata_vault[&#34;meta002&#34;].azurerm_key_vault_access_policy.developer[0]
  * module.data_landing_zone[&#34;01&#34;].module.metadata_vault[&#34;meta002&#34;].azurerm_key_vault_access_policy.product_team_access_policy
  * module.data_landing_zone[&#34;01&#34;].module.metadata_vault[&#34;meta002&#34;].azurerm_monitor_diagnostic_setting.kv-ds
  * module.data_landing_zone[&#34;01&#34;].module.metadata_vault_pe[&#34;meta001&#34;].azurerm_private_endpoint.this
  * module.data_landing_zone[&#34;01&#34;].module.metadata_vault_pe[&#34;meta002&#34;].azurerm_private_endpoint.this
  * module.data_landing_zone[&#34;01&#34;].module.networking.azurerm_network_security_group.this[&#34;nsg&#34;]
  * module.data_landing_zone[&#34;01&#34;].module.networking.azurerm_network_security_rule.deny_inbound[&#34;nsg&#34;]
  * module.data_landing_zone[&#34;01&#34;].module.networking.azurerm_network_security_rule.rules[&#34;nsg-Allow_SDS_PTL_ADO_Agents&#34;]
  * module.data_landing_zone[&#34;01&#34;].module.networking.azurerm_network_security_rule.rules[&#34;nsg-Dbricks-workspaces-UseOnly-databricks-worker-to-eventhub&#34;]
  * module.data_landing_zone[&#34;01&#34;].module.networking.azurerm_network_security_rule.rules[&#34;nsg-Dbricks-workspaces-UseOnly-databricks-worker-to-sql&#34;]
  * module.data_landing_zone[&#34;01&#34;].module.networking.azurerm_network_security_rule.rules[&#34;nsg-Dbricks-workspaces-UseOnly-databricks-worker-to-storage&#34;]
  * module.data_landing_zone[&#34;01&#34;].module.networking.azurerm_network_security_rule.rules[&#34;nsg-Dbricks-workspaces-UseOnly-databricks-worker-to-webapp&#34;]
  * module.data_landing_zone[&#34;01&#34;].module.networking.azurerm_network_security_rule.rules[&#34;nsg-Dbricks-workspaces-UseOnly-databricks-worker-to-worker-inbound&#34;]
  * module.data_landing_zone[&#34;01&#34;].module.networking.azurerm_network_security_rule.rules[&#34;nsg-Dbricks-workspaces-UseOnly-databricks-worker-to-worker-outbound&#34;]
  * module.data_landing_zone[&#34;01&#34;].module.networking.azurerm_route.this[&#34;rt-default&#34;]
  * module.data_landing_zone[&#34;01&#34;].module.networking.azurerm_route_table.this[&#34;rt&#34;]
  * module.data_landing_zone[&#34;01&#34;].module.networking.azurerm_subnet.this[&#34;vnet-data-bricks-private&#34;]
  * module.data_landing_zone[&#34;01&#34;].module.networking.azurerm_subnet.this[&#34;vnet-data-bricks-product-private&#34;]
  * module.data_landing_zone[&#34;01&#34;].module.networking.azurerm_subnet.this[&#34;vnet-data-bricks-product-public&#34;]
  * module.data_landing_zone[&#34;01&#34;].module.networking.azurerm_subnet.this[&#34;vnet-data-bricks-public&#34;]
  * module.data_landing_zone[&#34;01&#34;].module.networking.azurerm_subnet.this[&#34;vnet-data-integration-001&#34;]
  * module.data_landing_zone[&#34;01&#34;].module.networking.azurerm_subnet.this[&#34;vnet-data-integration-002&#34;]
  * module.data_landing_zone[&#34;01&#34;].module.networking.azurerm_subnet.this[&#34;vnet-data-product-001&#34;]
  * module.data_landing_zone[&#34;01&#34;].module.networking.azurerm_subnet.this[&#34;vnet-data-product-002&#34;]
  * module.data_landing_zone[&#34;01&#34;].module.networking.azurerm_subnet.this[&#34;vnet-services&#34;]
  * module.data_landing_zone[&#34;01&#34;].module.networking.azurerm_subnet.this[&#34;vnet-services-mysql&#34;]
  * module.data_landing_zone[&#34;01&#34;].module.networking.azurerm_subnet_network_security_group_association.this[&#34;nsg-vnet-data-bricks-private&#34;]
  * module.data_landing_zone[&#34;01&#34;].module.networking.azurerm_subnet_network_security_group_association.this[&#34;nsg-vnet-data-bricks-product-private&#34;]
  * module.data_landing_zone[&#34;01&#34;].module.networking.azurerm_subnet_network_security_group_association.this[&#34;nsg-vnet-data-bricks-product-public&#34;]
  * module.data_landing_zone[&#34;01&#34;].module.networking.azurerm_subnet_network_security_group_association.this[&#34;nsg-vnet-data-bricks-public&#34;]
  * module.data_landing_zone[&#34;01&#34;].module.networking.azurerm_subnet_network_security_group_association.this[&#34;nsg-vnet-data-integration-001&#34;]
  * module.data_landing_zone[&#34;01&#34;].module.networking.azurerm_subnet_network_security_group_association.this[&#34;nsg-vnet-data-integration-002&#34;]
  * module.data_landing_zone[&#34;01&#34;].module.networking.azurerm_subnet_network_security_group_association.this[&#34;nsg-vnet-data-product-001&#34;]
  * module.data_landing_zone[&#34;01&#34;].module.networking.azurerm_subnet_network_security_group_association.this[&#34;nsg-vnet-data-product-002&#34;]
  * module.data_landing_zone[&#34;01&#34;].module.networking.azurerm_subnet_network_security_group_association.this[&#34;nsg-vnet-services&#34;]
  * module.data_landing_zone[&#34;01&#34;].module.networking.azurerm_subnet_network_security_group_association.this[&#34;nsg-vnet-services-mysql&#34;]
  * module.data_landing_zone[&#34;01&#34;].module.networking.azurerm_subnet_route_table_association.this[&#34;rt-vnet-data-bricks-private&#34;]
  * module.data_landing_zone[&#34;01&#34;].module.networking.azurerm_subnet_route_table_association.this[&#34;rt-vnet-data-bricks-product-private&#34;]
  * module.data_landing_zone[&#34;01&#34;].module.networking.azurerm_subnet_route_table_association.this[&#34;rt-vnet-data-bricks-product-public&#34;]
  * module.data_landing_zone[&#34;01&#34;].module.networking.azurerm_subnet_route_table_association.this[&#34;rt-vnet-data-bricks-public&#34;]
  * module.data_landing_zone[&#34;01&#34;].module.networking.azurerm_subnet_route_table_association.this[&#34;rt-vnet-data-integration-001&#34;]
  * module.data_landing_zone[&#34;01&#34;].module.networking.azurerm_subnet_route_table_association.this[&#34;rt-vnet-data-integration-002&#34;]
  * module.data_landing_zone[&#34;01&#34;].module.networking.azurerm_subnet_route_table_association.this[&#34;rt-vnet-data-product-001&#34;]
  * module.data_landing_zone[&#34;01&#34;].module.networking.azurerm_subnet_route_table_association.this[&#34;rt-vnet-data-product-002&#34;]
  * module.data_landing_zone[&#34;01&#34;].module.networking.azurerm_subnet_route_table_association.this[&#34;rt-vnet-services&#34;]
  * module.data_landing_zone[&#34;01&#34;].module.networking.azurerm_subnet_route_table_association.this[&#34;rt-vnet-services-mysql&#34;]
  * module.data_landing_zone[&#34;01&#34;].module.networking.azurerm_virtual_network.this[&#34;vnet&#34;]
  * module.data_landing_zone[&#34;01&#34;].module.runtimes_datafactory.azurerm_data_factory.this
  * module.data_landing_zone[&#34;01&#34;].module.runtimes_datafactory.azurerm_data_factory_integration_runtime_azure.this
  * module.data_landing_zone[&#34;01&#34;].module.runtimes_datafactory.azurerm_data_factory_managed_private_endpoint.dependants[&#34;purview-eventhub&#34;]
  * module.data_landing_zone[&#34;01&#34;].module.runtimes_datafactory.azurerm_data_factory_managed_private_endpoint.dependants[&#34;purview-storage-blob&#34;]
  * module.data_landing_zone[&#34;01&#34;].module.runtimes_datafactory.azurerm_data_factory_managed_private_endpoint.dependants[&#34;purview-storage-queue&#34;]
  * module.data_landing_zone[&#34;01&#34;].module.runtimes_datafactory.azurerm_data_factory_managed_private_endpoint.this[&#34;purview&#34;]
  * module.data_landing_zone[&#34;01&#34;].module.runtimes_datafactory.azurerm_private_endpoint.this[&#34;dataFactory&#34;]
  * module.data_landing_zone[&#34;01&#34;].module.runtimes_datafactory.azurerm_private_endpoint.this[&#34;portal&#34;]
  * module.data_landing_zone[&#34;01&#34;].module.runtimes_datafactory.null_resource.private_endpoint_approvals[&#34;purview&#34;]
  * module.data_landing_zone[&#34;01&#34;].module.runtimes_datafactory.null_resource.private_endpoint_approvals[&#34;purview-eventhub&#34;]
  * module.data_landing_zone[&#34;01&#34;].module.runtimes_datafactory.null_resource.private_endpoint_approvals[&#34;purview-storage-blob&#34;]
  * module.data_landing_zone[&#34;01&#34;].module.runtimes_datafactory.null_resource.private_endpoint_approvals[&#34;purview-storage-queue&#34;]
  * module.data_landing_zone[&#34;01&#34;].module.shared_integration_databricks.azurerm_databricks_workspace.this
  * module.data_landing_zone[&#34;01&#34;].module.shared_integration_datafactory.azurerm_data_factory.this
  * module.data_landing_zone[&#34;01&#34;].module.shared_integration_datafactory.azurerm_data_factory_integration_runtime_azure.this
  * module.data_landing_zone[&#34;01&#34;].module.shared_integration_datafactory.azurerm_data_factory_linked_service_azure_blob_storage.this[&#34;ingest01curatedsbox&#34;]
  * module.data_landing_zone[&#34;01&#34;].module.shared_integration_datafactory.azurerm_data_factory_linked_service_azure_blob_storage.this[&#34;ingest01rawsbox&#34;]
  * module.data_landing_zone[&#34;01&#34;].module.shared_integration_datafactory.azurerm_data_factory_linked_service_azure_databricks.this[&#34;ingest01-integration-databricks001-sbox&#34;]
  * module.data_landing_zone[&#34;01&#34;].module.shared_integration_datafactory.azurerm_data_factory_linked_service_azure_sql_database.this[&#34;ingest01-metadata-db-sbox&#34;]
  * module.data_landing_zone[&#34;01&#34;].module.shared_integration_datafactory.azurerm_data_factory_linked_service_key_vault.this[&#34;ingest01-meta001-sbox&#34;]
  * module.data_landing_zone[&#34;01&#34;].module.shared_integration_datafactory.azurerm_data_factory_linked_service_sql_server.this[&#34;ingest01-metadata-mssql-sbox&#34;]
  * module.data_landing_zone[&#34;01&#34;].module.shared_integration_datafactory.azurerm_data_factory_managed_private_endpoint.dependants[&#34;purview-eventhub&#34;]
  * module.data_landing_zone[&#34;01&#34;].module.shared_integration_datafactory.azurerm_data_factory_managed_private_endpoint.dependants[&#34;purview-storage-blob&#34;]
  * module.data_landing_zone[&#34;01&#34;].module.shared_integration_datafactory.azurerm_data_factory_managed_private_endpoint.dependants[&#34;purview-storage-queue&#34;]
  * module.data_landing_zone[&#34;01&#34;].module.shared_integration_datafactory.azurerm_data_factory_managed_private_endpoint.this[&#34;keyvault&#34;]
  * module.data_landing_zone[&#34;01&#34;].module.shared_integration_datafactory.azurerm_data_factory_managed_private_endpoint.this[&#34;mssql&#34;]
  * module.data_landing_zone[&#34;01&#34;].module.shared_integration_datafactory.azurerm_data_factory_managed_private_endpoint.this[&#34;purview&#34;]
  * module.data_landing_zone[&#34;01&#34;].module.shared_integration_datafactory.azurerm_data_factory_managed_private_endpoint.this[&#34;storage-curated&#34;]
  * module.data_landing_zone[&#34;01&#34;].module.shared_integration_datafactory.azurerm_data_factory_managed_private_endpoint.this[&#34;storage-raw&#34;]
  * module.data_landing_zone[&#34;01&#34;].module.shared_integration_datafactory.azurerm_private_endpoint.this[&#34;dataFactory&#34;]
  * module.data_landing_zone[&#34;01&#34;].module.shared_integration_datafactory.azurerm_private_endpoint.this[&#34;portal&#34;]
  * module.data_landing_zone[&#34;01&#34;].module.shared_integration_datafactory.null_resource.private_endpoint_approvals[&#34;keyvault&#34;]
  * module.data_landing_zone[&#34;01&#34;].module.shared_integration_datafactory.null_resource.private_endpoint_approvals[&#34;mssql&#34;]
  * module.data_landing_zone[&#34;01&#34;].module.shared_integration_datafactory.null_resource.private_endpoint_approvals[&#34;purview&#34;]
  * module.data_landing_zone[&#34;01&#34;].module.shared_integration_datafactory.null_resource.private_endpoint_approvals[&#34;purview-eventhub&#34;]
  * module.data_landing_zone[&#34;01&#34;].module.shared_integration_datafactory.null_resource.private_endpoint_approvals[&#34;purview-storage-blob&#34;]
  * module.data_landing_zone[&#34;01&#34;].module.shared_integration_datafactory.null_resource.private_endpoint_approvals[&#34;purview-storage-queue&#34;]
  * module.data_landing_zone[&#34;01&#34;].module.shared_integration_datafactory.null_resource.private_endpoint_approvals[&#34;storage-curated&#34;]
  * module.data_landing_zone[&#34;01&#34;].module.shared_integration_datafactory.null_resource.private_endpoint_approvals[&#34;storage-raw&#34;]
  * module.data_landing_zone[&#34;01&#34;].module.shared_integration_eventhub_pe.azurerm_private_endpoint.this
  * module.data_landing_zone[&#34;01&#34;].module.shared_product_databricks.azurerm_databricks_workspace.this
  * module.data_landing_zone[&#34;01&#34;].module.shir001.azurerm_key_vault_secret.shir_password
  * module.data_landing_zone[&#34;01&#34;].module.shir001.azurerm_lb.shir_lb
  * module.data_landing_zone[&#34;01&#34;].module.shir001.azurerm_lb_backend_address_pool.shir
  * module.data_landing_zone[&#34;01&#34;].module.shir001.azurerm_lb_nat_pool.shir
  * module.data_landing_zone[&#34;01&#34;].module.shir001.azurerm_lb_probe.shir
  * module.data_landing_zone[&#34;01&#34;].module.shir001.azurerm_lb_rule.shir
  * module.data_landing_zone[&#34;01&#34;].module.shir001.azurerm_virtual_machine_scale_set_extension.shir_install
  * module.data_landing_zone[&#34;01&#34;].module.shir001.random_password.shir_password
  * module.data_landing_zone[&#34;01&#34;].module.storage[&#34;curated&#34;].azapi_update_resource.defender_settings
  * module.data_landing_zone[&#34;01&#34;].module.storage[&#34;curated&#34;].azurerm_storage_account.storage_account
  * module.data_landing_zone[&#34;01&#34;].module.storage[&#34;curated&#34;].azurerm_storage_container.container[&#34;data&#34;]
  * module.data_landing_zone[&#34;01&#34;].module.storage[&#34;curated&#34;].azurerm_storage_container.container[&#34;di001&#34;]
  * module.data_landing_zone[&#34;01&#34;].module.storage[&#34;curated&#34;].azurerm_storage_container.container[&#34;di002&#34;]
  * module.data_landing_zone[&#34;01&#34;].module.storage[&#34;curated&#34;].random_string.storage_account_random_string
  * module.data_landing_zone[&#34;01&#34;].module.storage[&#34;curated&#34;].time_rotating.rotate
  * module.data_landing_zone[&#34;01&#34;].module.storage[&#34;curated&#34;].time_static.pim_expiry
  * module.data_landing_zone[&#34;01&#34;].module.storage[&#34;curated&#34;].time_static.pim_start
  * module.data_landing_zone[&#34;01&#34;].module.storage[&#34;external&#34;].azapi_update_resource.defender_settings
  * module.data_landing_zone[&#34;01&#34;].module.storage[&#34;external&#34;].azurerm_storage_account.storage_account
  * module.data_landing_zone[&#34;01&#34;].module.storage[&#34;external&#34;].azurerm_storage_container.container[&#34;data&#34;]
  * module.data_landing_zone[&#34;01&#34;].module.storage[&#34;external&#34;].random_string.storage_account_random_string
  * module.data_landing_zone[&#34;01&#34;].module.storage[&#34;external&#34;].time_rotating.rotate
  * module.data_landing_zone[&#34;01&#34;].module.storage[&#34;external&#34;].time_static.pim_expiry
  * module.data_landing_zone[&#34;01&#34;].module.storage[&#34;external&#34;].time_static.pim_start
  * module.data_landing_zone[&#34;01&#34;].module.storage[&#34;raw&#34;].azapi_update_resource.defender_settings
  * module.data_landing_zone[&#34;01&#34;].module.storage[&#34;raw&#34;].azurerm_storage_account.storage_account
  * module.data_landing_zone[&#34;01&#34;].module.storage[&#34;raw&#34;].azurerm_storage_container.container[&#34;data&#34;]
  * module.data_landing_zone[&#34;01&#34;].module.storage[&#34;raw&#34;].azurerm_storage_container.container[&#34;di001&#34;]
  * module.data_landing_zone[&#34;01&#34;].module.storage[&#34;raw&#34;].azurerm_storage_container.container[&#34;di002&#34;]
  * module.data_landing_zone[&#34;01&#34;].module.storage[&#34;raw&#34;].random_string.storage_account_random_string
  * module.data_landing_zone[&#34;01&#34;].module.storage[&#34;raw&#34;].time_rotating.rotate
  * module.data_landing_zone[&#34;01&#34;].module.storage[&#34;raw&#34;].time_static.pim_expiry
  * module.data_landing_zone[&#34;01&#34;].module.storage[&#34;raw&#34;].time_static.pim_start
  * module.data_landing_zone[&#34;01&#34;].module.storage[&#34;workspace&#34;].azapi_update_resource.defender_settings
  * module.data_landing_zone[&#34;01&#34;].module.storage[&#34;workspace&#34;].azurerm_storage_account.storage_account
  * module.data_landing_zone[&#34;01&#34;].module.storage[&#34;workspace&#34;].azurerm_storage_container.container[&#34;data&#34;]
  * module.data_landing_zone[&#34;01&#34;].module.storage[&#34;workspace&#34;].azurerm_storage_container.container[&#34;dp001&#34;]
  * module.data_landing_zone[&#34;01&#34;].module.storage[&#34;workspace&#34;].azurerm_storage_container.container[&#34;dp002&#34;]
  * module.data_landing_zone[&#34;01&#34;].module.storage[&#34;workspace&#34;].random_string.storage_account_random_string
  * module.data_landing_zone[&#34;01&#34;].module.storage[&#34;workspace&#34;].time_rotating.rotate
  * module.data_landing_zone[&#34;01&#34;].module.storage[&#34;workspace&#34;].time_static.pim_expiry
  * module.data_landing_zone[&#34;01&#34;].module.storage[&#34;workspace&#34;].time_static.pim_start
  * module.data_landing_zone[&#34;01&#34;].module.storage_pe[&#34;curated-blob&#34;].azurerm_private_endpoint.this
  * module.data_landing_zone[&#34;01&#34;].module.storage_pe[&#34;curated-dfs&#34;].azurerm_private_endpoint.this
  * module.data_landing_zone[&#34;01&#34;].module.storage_pe[&#34;external-blob&#34;].azurerm_private_endpoint.this
  * module.data_landing_zone[&#34;01&#34;].module.storage_pe[&#34;external-dfs&#34;].azurerm_private_endpoint.this
  * module.data_landing_zone[&#34;01&#34;].module.storage_pe[&#34;raw-blob&#34;].azurerm_private_endpoint.this
  * module.data_landing_zone[&#34;01&#34;].module.storage_pe[&#34;raw-dfs&#34;].azurerm_private_endpoint.this
  * module.data_landing_zone[&#34;01&#34;].module.storage_pe[&#34;workspace-blob&#34;].azurerm_private_endpoint.this
  * module.data_landing_zone[&#34;01&#34;].module.storage_pe[&#34;workspace-dfs&#34;].azurerm_private_endpoint.this
  * module.data_landing_zone[&#34;01&#34;].module.synapse_pe[&#34;dev&#34;].azurerm_private_endpoint.this
  * module.data_landing_zone[&#34;01&#34;].module.synapse_pe[&#34;sql&#34;].azurerm_private_endpoint.this
  * module.data_landing_zone[&#34;01&#34;].module.synapse_pe[&#34;sqlOnDemand&#34;].azurerm_private_endpoint.this
  * module.data_landing_zone[&#34;01&#34;].module.vnet_peer_hub.azurerm_virtual_network_peering.initiator_to_target
  * module.data_landing_zone[&#34;01&#34;].module.vnet_peer_hub.azurerm_virtual_network_peering.target_to_initiator
  * module.data_landing_zone[&#34;01&#34;].module.shir001.module.shir_vmss.azurerm_windows_virtual_machine_scale_set.windows_scale_set[0]
  * module.data_landing_zone[&#34;01&#34;].module.shir001.module.shir_vmss.random_string.password
* Update
  * module.data_landing_zone[&#34;00&#34;].module.metadata_mssql.azurerm_mssql_server.this
  * module.data_landing_zone[&#34;00&#34;].module.networking.azurerm_subnet.this[&#34;vnet-data-product-001&#34;]
  * module.data_landing_zone[&#34;00&#34;].module.networking.azurerm_subnet.this[&#34;vnet-data-product-002&#34;]




<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_container_group.runner["00dlrm-ingestionengine"] will be created
  + resource "azurerm_container_group" "runner" {
      + dns_name_label_reuse_policy = "Unsecure"
      + exposed_port                = (known after apply)
      + fqdn                        = (known after apply)
      + id                          = (known after apply)
      + ip_address                  = (known after apply)
      + ip_address_type             = "Private"
      + location                    = "uksouth"
      + name                        = "ingest00-runner-sbox"
      + network_profile_id          = (known after apply)
      + os_type                     = "Linux"
      + resource_group_name         = "ingest00-management-sbox"
      + restart_policy              = "Always"
      + sku                         = "Standard"
      + subnet_ids                  = [
          + "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest00-network-sbox/providers/Microsoft.Network/virtualNetworks/ingest00-vnet-sbox/subnets/ingest00-services-sbox",
        ]
      + tags                        = {
          + "Data-Ingest-Project" = "example landing zone"
          + "application"         = "dlrm-data-ingest"
          + "builtFrom"           = "hmcts/dlrm-data-ingest-infra"
          + "businessArea"        = "cross-cutting"
          + "criticality"         = "Low"
          + "environment"         = "sandbox"
          + "expiresAfter"        = "3000-01-01"
          + "startupMode"         = "always"
        }

      + container {
          + commands              = (known after apply)
          + cpu                   = 0.5
          + environment_variables = {
              + "GH_OWNER"      = "hmcts"
              + "GH_REPOSITORY" = "dlrm-ingestionengine"
              + "GH_TOKEN"      = (sensitive value)
            }
          + image                 = "hmctspublic.azurecr.io/github-runner:prod-84d74135-1707147900"
          + memory                = 1.5
          + name                  = "runner"

          + ports {
              + port     = 8080
              + protocol = "TCP"
            }
        }
    }

  # module.data_landing_zone["01"].azurerm_data_factory_integration_runtime_self_hosted.this will be created
  + resource "azurerm_data_factory_integration_runtime_self_hosted" "this" {
      + data_factory_id             = (known after apply)
      + description                 = "Data Landing Zone - Self Hosted Integration Runtime running on ingest01-shir001"
      + id                          = (known after apply)
      + name                        = "ingest01-runtimes-dataFactory001-shir001"
      + primary_authorization_key   = (known after apply)
      + secondary_authorization_key = (known after apply)
    }

  # module.data_landing_zone["01"].azurerm_eventhub_namespace.this will be created
  + resource "azurerm_eventhub_namespace" "this" {
      + auto_inflate_enabled                      = true
      + capacity                                  = 1
      + default_primary_connection_string         = (sensitive value)
      + default_primary_connection_string_alias   = (sensitive value)
      + default_primary_key                       = (sensitive value)
      + default_secondary_connection_string       = (sensitive value)
      + default_secondary_connection_string_alias = (sensitive value)
      + default_secondary_key                     = (sensitive value)
      + id                                        = (known after apply)
      + local_authentication_enabled              = true
      + location                                  = "uksouth"
      + maximum_throughput_units                  = 2
      + minimum_tls_version                       = (known after apply)
      + name                                      = "ingest01-integration-eventHubNamespace001-sbox"
      + network_rulesets                          = (known after apply)
      + public_network_access_enabled             = true
      + resource_group_name                       = "ingest01-shared-integration-sbox"
      + sku                                       = "Standard"
      + tags                                      = {
          + "Data-Ingest-Project" = "ajb test"
          + "application"         = "dlrm-data-ingest"
          + "builtFrom"           = "hmcts/dlrm-data-ingest-infra"
          + "businessArea"        = "cross-cutting"
          + "criticality"         = "Low"
          + "environment"         = "sandbox"
          + "expiresAfter"        = "3000-01-01"
          + "startupMode"         = "always"
        }
      + zone_redundant                            = true

      + identity {
          + principal_id = (known after apply)
          + tenant_id    = (known after apply)
          + type         = "SystemAssigned"
        }
    }

  # module.data_landing_zone["01"].azurerm_key_vault_secret.log_analytics_workspace_id will be created
  + resource "azurerm_key_vault_secret" "log_analytics_workspace_id" {
      + id                      = (known after apply)
      + key_vault_id            = (known after apply)
      + name                    = "ingest01-logAnalytics001-sbox-id"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # module.data_landing_zone["01"].azurerm_key_vault_secret.log_analytics_workspace_secret will be created
  + resource "azurerm_key_vault_secret" "log_analytics_workspace_secret" {
      + id                      = (known after apply)
      + key_vault_id            = (known after apply)
      + name                    = "ingest01-logAnalytics001-sbox-key"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # module.data_landing_zone["01"].azurerm_key_vault_secret.mssql_password will be created
  + resource "azurerm_key_vault_secret" "mssql_password" {
      + id                      = (known after apply)
      + key_vault_id            = (known after apply)
      + name                    = "ingest01-metadata-mssql-password-sbox"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # module.data_landing_zone["01"].azurerm_key_vault_secret.mssql_username will be created
  + resource "azurerm_key_vault_secret" "mssql_username" {
      + id                      = (known after apply)
      + key_vault_id            = (known after apply)
      + name                    = "ingest01-metadata-mssql-username-sbox"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # module.data_landing_zone["01"].azurerm_key_vault_secret.mysql_connection_string will be created
  + resource "azurerm_key_vault_secret" "mysql_connection_string" {
      + id                      = (known after apply)
      + key_vault_id            = (known after apply)
      + name                    = "ingest01-metadata-mysql-connection-string-sbox"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # module.data_landing_zone["01"].azurerm_key_vault_secret.mysql_password will be created
  + resource "azurerm_key_vault_secret" "mysql_password" {
      + id                      = (known after apply)
      + key_vault_id            = (known after apply)
      + name                    = "ingest01-metadata-mysql-password-sbox"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # module.data_landing_zone["01"].azurerm_key_vault_secret.mysql_username will be created
  + resource "azurerm_key_vault_secret" "mysql_username" {
      + id                      = (known after apply)
      + key_vault_id            = (known after apply)
      + name                    = "ingest01-metadata-mysql-username-sbox"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # module.data_landing_zone["01"].azurerm_key_vault_secret.synapse_sql_password will be created
  + resource "azurerm_key_vault_secret" "synapse_sql_password" {
      + id                      = (known after apply)
      + key_vault_id            = (known after apply)
      + name                    = "ingest01-product-synapse001-sql-password-sbox"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # module.data_landing_zone["01"].azurerm_key_vault_secret.synapse_sql_username will be created
  + resource "azurerm_key_vault_secret" "synapse_sql_username" {
      + id                      = (known after apply)
      + key_vault_id            = (known after apply)
      + name                    = "ingest01-product-synapse001-sql-username-sbox"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # module.data_landing_zone["01"].azurerm_log_analytics_workspace.this will be created
  + resource "azurerm_log_analytics_workspace" "this" {
      + allow_resource_only_permissions = true
      + daily_quota_gb                  = -1
      + id                              = (known after apply)
      + internet_ingestion_enabled      = true
      + internet_query_enabled          = true
      + local_authentication_disabled   = false
      + location                        = "uksouth"
      + name                            = "ingest01-logAnalytics001-sbox"
      + primary_shared_key              = (sensitive value)
      + resource_group_name             = "ingest01-logging-sbox"
      + retention_in_days               = (known after apply)
      + secondary_shared_key            = (sensitive value)
      + sku                             = "PerGB2018"
      + tags                            = {
          + "Data-Ingest-Project" = "ajb test"
          + "application"         = "dlrm-data-ingest"
          + "builtFrom"           = "hmcts/dlrm-data-ingest-infra"
          + "businessArea"        = "cross-cutting"
          + "criticality"         = "Low"
          + "environment"         = "sandbox"
          + "expiresAfter"        = "3000-01-01"
          + "startupMode"         = "always"
        }
      + workspace_id                    = (known after apply)
    }

  # module.data_landing_zone["01"].azurerm_private_dns_zone_virtual_network_link.data_landing_link["privatelink.adf.azure.com"] will be created
  + resource "azurerm_private_dns_zone_virtual_network_link" "data_landing_link" {
      + id                    = (known after apply)
      + name                  = "ingest01-adf-data-landing-link-sbox"
      + private_dns_zone_name = "privatelink.adf.azure.com"
      + registration_enabled  = false
      + resource_group_name   = "core-infra-intsvc-rg"
      + tags                  = {
          + "Data-Ingest-Project" = "ajb test"
          + "application"         = "dlrm-data-ingest"
          + "builtFrom"           = "hmcts/dlrm-data-ingest-infra"
          + "businessArea"        = "cross-cutting"
          + "criticality"         = "Low"
          + "environment"         = "sandbox"
          + "expiresAfter"        = "3000-01-01"
          + "startupMode"         = "always"
        }
      + virtual_network_id    = (known after apply)
    }

  # module.data_landing_zone["01"].azurerm_private_dns_zone_virtual_network_link.data_landing_link["privatelink.blob.core.windows.net"] will be created
  + resource "azurerm_private_dns_zone_virtual_network_link" "data_landing_link" {
      + id                    = (known after apply)
      + name                  = "ingest01-blob-data-landing-link-sbox"
      + private_dns_zone_name = "privatelink.blob.core.windows.net"
      + registration_enabled  = false
      + resource_group_name   = "core-infra-intsvc-rg"
      + tags                  = {
          + "Data-Ingest-Project" = "ajb test"
          + "application"         = "dlrm-data-ingest"
          + "builtFrom"           = "hmcts/dlrm-data-ingest-infra"
          + "businessArea"        = "cross-cutting"
          + "criticality"         = "Low"
          + "environment"         = "sandbox"
          + "expiresAfter"        = "3000-01-01"
          + "startupMode"         = "always"
        }
      + virtual_network_id    = (known after apply)
    }

  # module.data_landing_zone["01"].azurerm_private_dns_zone_virtual_network_link.data_landing_link["privatelink.datafactory.azure.net"] will be created
  + resource "azurerm_private_dns_zone_virtual_network_link" "data_landing_link" {
      + id                    = (known after apply)
      + name                  = "ingest01-datafactory-data-landing-link-sbox"
      + private_dns_zone_name = "privatelink.datafactory.azure.net"
      + registration_enabled  = false
      + resource_group_name   = "core-infra-intsvc-rg"
      + tags                  = {
          + "Data-Ingest-Project" = "ajb test"
          + "application"         = "dlrm-data-ingest"
          + "builtFrom"           = "hmcts/dlrm-data-ingest-infra"
          + "businessArea"        = "cross-cutting"
          + "criticality"         = "Low"
          + "environment"         = "sandbox"
          + "expiresAfter"        = "3000-01-01"
          + "startupMode"         = "always"
        }
      + virtual_network_id    = (known after apply)
    }

  # module.data_landing_zone["01"].azurerm_private_dns_zone_virtual_network_link.data_landing_link["privatelink.dev.azuresynapse.net"] will be created
  + resource "azurerm_private_dns_zone_virtual_network_link" "data_landing_link" {
      + id                    = (known after apply)
      + name                  = "ingest01-dev-data-landing-link-sbox"
      + private_dns_zone_name = "privatelink.dev.azuresynapse.net"
      + registration_enabled  = false
      + resource_group_name   = "core-infra-intsvc-rg"
      + tags                  = {
          + "Data-Ingest-Project" = "ajb test"
          + "application"         = "dlrm-data-ingest"
          + "builtFrom"           = "hmcts/dlrm-data-ingest-infra"
          + "businessArea"        = "cross-cutting"
          + "criticality"         = "Low"
          + "environment"         = "sandbox"
          + "expiresAfter"        = "3000-01-01"
          + "startupMode"         = "always"
        }
      + virtual_network_id    = (known after apply)
    }

  # module.data_landing_zone["01"].azurerm_private_dns_zone_virtual_network_link.data_landing_link["privatelink.dfs.core.windows.net"] will be created
  + resource "azurerm_private_dns_zone_virtual_network_link" "data_landing_link" {
      + id                    = (known after apply)
      + name                  = "ingest01-dfs-data-landing-link-sbox"
      + private_dns_zone_name = "privatelink.dfs.core.windows.net"
      + registration_enabled  = false
      + resource_group_name   = "core-infra-intsvc-rg"
      + tags                  = {
          + "Data-Ingest-Project" = "ajb test"
          + "application"         = "dlrm-data-ingest"
          + "builtFrom"           = "hmcts/dlrm-data-ingest-infra"
          + "businessArea"        = "cross-cutting"
          + "criticality"         = "Low"
          + "environment"         = "sandbox"
          + "expiresAfter"        = "3000-01-01"
          + "startupMode"         = "always"
        }
      + virtual_network_id    = (known after apply)
    }

  # module.data_landing_zone["01"].azurerm_private_dns_zone_virtual_network_link.data_landing_link["privatelink.mysql.database.azure.com"] will be created
  + resource "azurerm_private_dns_zone_virtual_network_link" "data_landing_link" {
      + id                    = (known after apply)
      + name                  = "ingest01-mysql-data-landing-link-sbox"
      + private_dns_zone_name = "privatelink.mysql.database.azure.com"
      + registration_enabled  = false
      + resource_group_name   = "core-infra-intsvc-rg"
      + tags                  = {
          + "Data-Ingest-Project" = "ajb test"
          + "application"         = "dlrm-data-ingest"
          + "builtFrom"           = "hmcts/dlrm-data-ingest-infra"
          + "businessArea"        = "cross-cutting"
          + "criticality"         = "Low"
          + "environment"         = "sandbox"
          + "expiresAfter"        = "3000-01-01"
          + "startupMode"         = "always"
        }
      + virtual_network_id    = (known after apply)
    }

  # module.data_landing_zone["01"].azurerm_private_dns_zone_virtual_network_link.data_landing_link["privatelink.servicebus.windows.net"] will be created
  + resource "azurerm_private_dns_zone_virtual_network_link" "data_landing_link" {
      + id                    = (known after apply)
      + name                  = "ingest01-servicebus-data-landing-link-sbox"
      + private_dns_zone_name = "privatelink.servicebus.windows.net"
      + registration_enabled  = false
      + resource_group_name   = "core-infra-intsvc-rg"
      + tags                  = {
          + "Data-Ingest-Project" = "ajb test"
          + "application"         = "dlrm-data-ingest"
          + "builtFrom"           = "hmcts/dlrm-data-ingest-infra"
          + "businessArea"        = "cross-cutting"
          + "criticality"         = "Low"
          + "environment"         = "sandbox"
          + "expiresAfter"        = "3000-01-01"
          + "startupMode"         = "always"
        }
      + virtual_network_id    = (known after apply)
    }

  # module.data_landing_zone["01"].azurerm_private_dns_zone_virtual_network_link.data_landing_link["privatelink.sql.azuresynapse.net"] will be created
  + resource "azurerm_private_dns_zone_virtual_network_link" "data_landing_link" {
      + id                    = (known after apply)
      + name                  = "ingest01-sql-data-landing-link-sbox"
      + private_dns_zone_name = "privatelink.sql.azuresynapse.net"
      + registration_enabled  = false
      + resource_group_name   = "core-infra-intsvc-rg"
      + tags                  = {
          + "Data-Ingest-Project" = "ajb test"
          + "application"         = "dlrm-data-ingest"
          + "builtFrom"           = "hmcts/dlrm-data-ingest-infra"
          + "businessArea"        = "cross-cutting"
          + "criticality"         = "Low"
          + "environment"         = "sandbox"
          + "expiresAfter"        = "3000-01-01"
          + "startupMode"         = "always"
        }
      + virtual_network_id    = (known 

# ...
# ... The maximum length of GitHub Comment is 65536, so the content is omitted by tfcmt.
# ...

ork_interface        = (known after apply)
      + private_dns_zone_configs = (known after apply)
      + resource_group_name      = "ingest01-storage-sbox"
      + subnet_id                = (known after apply)
      + tags                     = {
          + "Data-Ingest-Project" = "ajb test"
          + "application"         = "dlrm-data-ingest"
          + "builtFrom"           = "hmcts/dlrm-data-ingest-infra"
          + "businessArea"        = "cross-cutting"
          + "criticality"         = "Low"
          + "environment"         = "sandbox"
          + "expiresAfter"        = "3000-01-01"
          + "startupMode"         = "always"
        }

      + private_dns_zone_group {
          + id                   = (known after apply)
          + name                 = "endpoint-dnszonegroup"
          + private_dns_zone_ids = [
              + "/subscriptions/1baf5470-1c3e-40d3-a6f7-74bfbce4b348/resourceGroups/core-infra-intsvc-rg/providers/Microsoft.Network/privateDnsZones/privatelink.blob.core.windows.net",
            ]
        }

      + private_service_connection {
          + is_manual_connection           = false
          + name                           = "ingest01rawsbox"
          + private_connection_resource_id = (known after apply)
          + private_ip_address             = (known after apply)
          + subresource_names              = [
              + "blob",
            ]
        }
    }

  # module.data_landing_zone["01"].module.storage_pe["raw-dfs"].azurerm_private_endpoint.this will be created
  + resource "azurerm_private_endpoint" "this" {
      + custom_dns_configs       = (known after apply)
      + id                       = (known after apply)
      + location                 = "uksouth"
      + name                     = "ingest01-raw-dfs-pe-sbox"
      + network_interface        = (known after apply)
      + private_dns_zone_configs = (known after apply)
      + resource_group_name      = "ingest01-storage-sbox"
      + subnet_id                = (known after apply)
      + tags                     = {
          + "Data-Ingest-Project" = "ajb test"
          + "application"         = "dlrm-data-ingest"
          + "builtFrom"           = "hmcts/dlrm-data-ingest-infra"
          + "businessArea"        = "cross-cutting"
          + "criticality"         = "Low"
          + "environment"         = "sandbox"
          + "expiresAfter"        = "3000-01-01"
          + "startupMode"         = "always"
        }

      + private_dns_zone_group {
          + id                   = (known after apply)
          + name                 = "endpoint-dnszonegroup"
          + private_dns_zone_ids = [
              + "/subscriptions/1baf5470-1c3e-40d3-a6f7-74bfbce4b348/resourceGroups/core-infra-intsvc-rg/providers/Microsoft.Network/privateDnsZones/privatelink.dfs.core.windows.net",
            ]
        }

      + private_service_connection {
          + is_manual_connection           = false
          + name                           = "ingest01rawsbox"
          + private_connection_resource_id = (known after apply)
          + private_ip_address             = (known after apply)
          + subresource_names              = [
              + "dfs",
            ]
        }
    }

  # module.data_landing_zone["01"].module.storage_pe["workspace-blob"].azurerm_private_endpoint.this will be created
  + resource "azurerm_private_endpoint" "this" {
      + custom_dns_configs       = (known after apply)
      + id                       = (known after apply)
      + location                 = "uksouth"
      + name                     = "ingest01-workspace-blob-pe-sbox"
      + network_interface        = (known after apply)
      + private_dns_zone_configs = (known after apply)
      + resource_group_name      = "ingest01-storage-sbox"
      + subnet_id                = (known after apply)
      + tags                     = {
          + "Data-Ingest-Project" = "ajb test"
          + "application"         = "dlrm-data-ingest"
          + "builtFrom"           = "hmcts/dlrm-data-ingest-infra"
          + "businessArea"        = "cross-cutting"
          + "criticality"         = "Low"
          + "environment"         = "sandbox"
          + "expiresAfter"        = "3000-01-01"
          + "startupMode"         = "always"
        }

      + private_dns_zone_group {
          + id                   = (known after apply)
          + name                 = "endpoint-dnszonegroup"
          + private_dns_zone_ids = [
              + "/subscriptions/1baf5470-1c3e-40d3-a6f7-74bfbce4b348/resourceGroups/core-infra-intsvc-rg/providers/Microsoft.Network/privateDnsZones/privatelink.blob.core.windows.net",
            ]
        }

      + private_service_connection {
          + is_manual_connection           = false
          + name                           = "ingest01workspacesbox"
          + private_connection_resource_id = (known after apply)
          + private_ip_address             = (known after apply)
          + subresource_names              = [
              + "blob",
            ]
        }
    }

  # module.data_landing_zone["01"].module.storage_pe["workspace-dfs"].azurerm_private_endpoint.this will be created
  + resource "azurerm_private_endpoint" "this" {
      + custom_dns_configs       = (known after apply)
      + id                       = (known after apply)
      + location                 = "uksouth"
      + name                     = "ingest01-workspace-dfs-pe-sbox"
      + network_interface        = (known after apply)
      + private_dns_zone_configs = (known after apply)
      + resource_group_name      = "ingest01-storage-sbox"
      + subnet_id                = (known after apply)
      + tags                     = {
          + "Data-Ingest-Project" = "ajb test"
          + "application"         = "dlrm-data-ingest"
          + "builtFrom"           = "hmcts/dlrm-data-ingest-infra"
          + "businessArea"        = "cross-cutting"
          + "criticality"         = "Low"
          + "environment"         = "sandbox"
          + "expiresAfter"        = "3000-01-01"
          + "startupMode"         = "always"
        }

      + private_dns_zone_group {
          + id                   = (known after apply)
          + name                 = "endpoint-dnszonegroup"
          + private_dns_zone_ids = [
              + "/subscriptions/1baf5470-1c3e-40d3-a6f7-74bfbce4b348/resourceGroups/core-infra-intsvc-rg/providers/Microsoft.Network/privateDnsZones/privatelink.dfs.core.windows.net",
            ]
        }

      + private_service_connection {
          + is_manual_connection           = false
          + name                           = "ingest01workspacesbox"
          + private_connection_resource_id = (known after apply)
          + private_ip_address             = (known after apply)
          + subresource_names              = [
              + "dfs",
            ]
        }
    }

  # module.data_landing_zone["01"].module.synapse_pe["dev"].azurerm_private_endpoint.this will be created
  + resource "azurerm_private_endpoint" "this" {
      + custom_dns_configs       = (known after apply)
      + id                       = (known after apply)
      + location                 = "uksouth"
      + name                     = "ingest01-product-synapse001-dev-pe-sbox"
      + network_interface        = (known after apply)
      + private_dns_zone_configs = (known after apply)
      + resource_group_name      = "ingest01-shared-product-sbox"
      + subnet_id                = (known after apply)
      + tags                     = {
          + "Data-Ingest-Project" = "ajb test"
          + "application"         = "dlrm-data-ingest"
          + "builtFrom"           = "hmcts/dlrm-data-ingest-infra"
          + "businessArea"        = "cross-cutting"
          + "criticality"         = "Low"
          + "environment"         = "sandbox"
          + "expiresAfter"        = "3000-01-01"
          + "startupMode"         = "always"
        }

      + private_dns_zone_group {
          + id                   = (known after apply)
          + name                 = "endpoint-dnszonegroup"
          + private_dns_zone_ids = [
              + "/subscriptions/1baf5470-1c3e-40d3-a6f7-74bfbce4b348/resourceGroups/core-infra-intsvc-rg/providers/Microsoft.Network/privateDnsZones/privatelink.dev.azuresynapse.net",
            ]
        }

      + private_service_connection {
          + is_manual_connection           = false
          + name                           = "ingest01-product-synapse001-sbox"
          + private_connection_resource_id = (known after apply)
          + private_ip_address             = (known after apply)
          + subresource_names              = [
              + "dev",
            ]
        }
    }

  # module.data_landing_zone["01"].module.synapse_pe["sql"].azurerm_private_endpoint.this will be created
  + resource "azurerm_private_endpoint" "this" {
      + custom_dns_configs       = (known after apply)
      + id                       = (known after apply)
      + location                 = "uksouth"
      + name                     = "ingest01-product-synapse001-sql-pe-sbox"
      + network_interface        = (known after apply)
      + private_dns_zone_configs = (known after apply)
      + resource_group_name      = "ingest01-shared-product-sbox"
      + subnet_id                = (known after apply)
      + tags                     = {
          + "Data-Ingest-Project" = "ajb test"
          + "application"         = "dlrm-data-ingest"
          + "builtFrom"           = "hmcts/dlrm-data-ingest-infra"
          + "businessArea"        = "cross-cutting"
          + "criticality"         = "Low"
          + "environment"         = "sandbox"
          + "expiresAfter"        = "3000-01-01"
          + "startupMode"         = "always"
        }

      + private_dns_zone_group {
          + id                   = (known after apply)
          + name                 = "endpoint-dnszonegroup"
          + private_dns_zone_ids = [
              + "/subscriptions/1baf5470-1c3e-40d3-a6f7-74bfbce4b348/resourceGroups/core-infra-intsvc-rg/providers/Microsoft.Network/privateDnsZones/privatelink.sql.azuresynapse.net",
            ]
        }

      + private_service_connection {
          + is_manual_connection           = false
          + name                           = "ingest01-product-synapse001-sbox"
          + private_connection_resource_id = (known after apply)
          + private_ip_address             = (known after apply)
          + subresource_names              = [
              + "sql",
            ]
        }
    }

  # module.data_landing_zone["01"].module.synapse_pe["sqlOnDemand"].azurerm_private_endpoint.this will be created
  + resource "azurerm_private_endpoint" "this" {
      + custom_dns_configs       = (known after apply)
      + id                       = (known after apply)
      + location                 = "uksouth"
      + name                     = "ingest01-product-synapse001-sqlOnDemand-pe-sbox"
      + network_interface        = (known after apply)
      + private_dns_zone_configs = (known after apply)
      + resource_group_name      = "ingest01-shared-product-sbox"
      + subnet_id                = (known after apply)
      + tags                     = {
          + "Data-Ingest-Project" = "ajb test"
          + "application"         = "dlrm-data-ingest"
          + "builtFrom"           = "hmcts/dlrm-data-ingest-infra"
          + "businessArea"        = "cross-cutting"
          + "criticality"         = "Low"
          + "environment"         = "sandbox"
          + "expiresAfter"        = "3000-01-01"
          + "startupMode"         = "always"
        }

      + private_dns_zone_group {
          + id                   = (known after apply)
          + name                 = "endpoint-dnszonegroup"
          + private_dns_zone_ids = [
              + "/subscriptions/1baf5470-1c3e-40d3-a6f7-74bfbce4b348/resourceGroups/core-infra-intsvc-rg/providers/Microsoft.Network/privateDnsZones/privatelink.sql.azuresynapse.net",
            ]
        }

      + private_service_connection {
          + is_manual_connection           = false
          + name                           = "ingest01-product-synapse001-sbox"
          + private_connection_resource_id = (known after apply)
          + private_ip_address             = (known after apply)
          + subresource_names              = [
              + "sqlOnDemand",
            ]
        }
    }

  # module.data_landing_zone["01"].module.vnet_peer_hub.azurerm_virtual_network_peering.initiator_to_target will be created
  + resource "azurerm_virtual_network_peering" "initiator_to_target" {
      + allow_forwarded_traffic      = true
      + allow_gateway_transit        = false
      + allow_virtual_network_access = true
      + id                           = (known after apply)
      + name                         = "ingest01-vnet-sbox-to-hub"
      + remote_virtual_network_id    = "/subscriptions/ea3a8c1e-af9d-4108-bc86-a7e2d267f49c/resourceGroups/hmcts-hub-sbox-int/providers/Microsoft.Network/virtualNetworks/hmcts-hub-sbox-int"
      + resource_group_name          = "ingest01-network-sbox"
      + use_remote_gateways          = false
      + virtual_network_name         = "ingest01-vnet-sbox"
    }

  # module.data_landing_zone["01"].module.vnet_peer_hub.azurerm_virtual_network_peering.target_to_initiator will be created
  + resource "azurerm_virtual_network_peering" "target_to_initiator" {
      + allow_forwarded_traffic      = true
      + allow_gateway_transit        = false
      + allow_virtual_network_access = true
      + id                           = (known after apply)
      + name                         = "hub-to-ingest01-vnet-sbox"
      + remote_virtual_network_id    = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest01-network-sbox/providers/Microsoft.Network/virtualNetworks/ingest01-vnet-sbox"
      + resource_group_name          = "hmcts-hub-sbox-int"
      + use_remote_gateways          = false
      + virtual_network_name         = "hmcts-hub-sbox-int"
    }

  # module.data_landing_zone["00"].module.shir001.module.shir_vmss.data.azurerm_subscription.current will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_subscription" "current" {
      + display_name          = (known after apply)
      + id                    = (known after apply)
      + location_placement_id = (known after apply)
      + quota_id              = (known after apply)
      + spending_limit        = (known after apply)
      + state                 = (known after apply)
      + subscription_id       = (known after apply)
      + tags                  = (known after apply)
      + tenant_id             = (known after apply)
    }

  # module.data_landing_zone["01"].module.shir001.module.shir_vmss.data.azurerm_subscription.current will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_subscription" "current" {
      + display_name          = (known after apply)
      + id                    = (known after apply)
      + location_placement_id = (known after apply)
      + quota_id              = (known after apply)
      + spending_limit        = (known after apply)
      + state                 = (known after apply)
      + subscription_id       = (known after apply)
      + tags                  = (known after apply)
      + tenant_id             = (known after apply)
    }

  # module.data_landing_zone["01"].module.shir001.module.shir_vmss.azurerm_windows_virtual_machine_scale_set.windows_scale_set[0] will be created
  + resource "azurerm_windows_virtual_machine_scale_set" "windows_scale_set" {
      + admin_password                                    = (sensitive value)
      + admin_username                                    = "VMAdmin"
      + computer_name_prefix                              = "shir001"
      + do_not_run_extensions_on_overprovisioned_machines = false
      + enable_automatic_updates                          = true
      + extension_operations_enabled                      = (known after apply)
      + extensions_time_budget                            = "PT1H30M"
      + id                                                = (known after apply)
      + instances                                         = 1
      + location                                          = "uksouth"
      + max_bid_price                                     = -1
      + name                                              = "ingest01-shir001-vmss-sbox"
      + overprovision                                     = true
      + platform_fault_domain_count                       = (known after apply)
      + priority                                          = "Regular"
      + provision_vm_agent                                = true
      + resource_group_name                               = "ingest01-runtimes-sbox"
      + scale_in_policy                                   = (known after apply)
      + single_placement_group                            = true
      + sku                                               = "Standard_D4ds_v5"
      + tags                                              = {
          + "Data-Ingest-Project" = "ajb test"
          + "application"         = "dlrm-data-ingest"
          + "builtFrom"           = "hmcts/dlrm-data-ingest-infra"
          + "businessArea"        = "cross-cutting"
          + "criticality"         = "Low"
          + "environment"         = "sandbox"
          + "expiresAfter"        = "3000-01-01"
          + "startupMode"         = "always"
        }
      + unique_id                                         = (known after apply)
      + upgrade_mode                                      = "Automatic"
      + zone_balance                                      = false
      + zones                                             = [
          + "1",
        ]

      + identity {
          + principal_id = (known after apply)
          + tenant_id    = (known after apply)
          + type         = "SystemAssigned"
        }

      + network_interface {
          + enable_accelerated_networking = false
          + enable_ip_forwarding          = false
          + name                          = "ingest01-shir001-nic"
          + primary                       = true

          + ip_configuration {
              + load_balancer_backend_address_pool_ids = (known after apply)
              + load_balancer_inbound_nat_rules_ids    = (known after apply)
              + name                                   = "ingest01-shir001-ipconfig"
              + primary                                = true
              + subnet_id                              = (known after apply)
              + version                                = "IPv4"
            }
        }

      + os_disk {
          + caching                   = "ReadWrite"
          + disk_size_gb              = (known after apply)
          + storage_account_type      = "StandardSSD_LRS"
          + write_accelerator_enabled = false
        }

      + source_image_reference {
          + offer     = "WindowsServer"
          + publisher = "MicrosoftWindowsServer"
          + sku       = "2022-datacenter-azure-edition"
          + version   = "latest"
        }
    }

  # module.data_landing_zone["01"].module.shir001.module.shir_vmss.random_string.password will be created
  + resource "random_string" "password" {
      + id          = (known after apply)
      + length      = 4
      + lower       = true
      + min_lower   = 0
      + min_numeric = 0
      + min_special = 0
      + min_upper   = 0
      + number      = true
      + numeric     = true
      + result      = (known after apply)
      + special     = false
      + upper       = true
    }

Plan: 213 to add, 3 to change, 0 to destroy.
```

</details>





<!-- github-comment: {"Command":"plan","PRNumber":22,"Program":"tfcmt","SHA1":"","Target":"sbox_landing","Vars":{}} -->